{
    "updates": [
      {
        "version": "Beta 0.1",
        "changes": [
          "Implementata la funzionalità di creazione e gestione del profilo utente, con possibilità di modificare immagine e nome utente.",
          "Aggiunta la possibilità di uscire dal profilo tramite il pulsante \"Esci\" nella gestione utente.",
          "Attenzione: l'uscita comporterà la cancellazione del profilo e di tutti i dati associati.",
          "Introdotta la visualizzazione della legenda colori dei lavori tramite il pulsante circolare con icona di punto esclamativo."
        ]
      },
      {
        "version": "Beta 0.2",
        "changes": [
          "Implementata la funzione di cambio mappa tramite il pulsante circolare dedicato.",
          "Mappe disponibili:",
          "Esri Satellitare (Mappa base 1)",
          "OpenStreetMap (OSM) Base (Mappa 2)",
          "Nota: nuove mappe saranno aggiunte in aggiornamenti futuri."
        ]
      },
      {
        "version": "Beta 0.3",
        "changes": [
          "Risolto un bug che causava la scomparsa dell'immagine utente alla chiusura della PWA. Ora l'immagine profilo viene salvata nella cache.",
          "Migliorata la gestione della cache utente:",
          "Il profilo e i relativi dati sono ora salvati nella cache locale.",
          "I dati verranno persi solo nei seguenti casi:",
          "L'utente esce dal profilo tramite il pulsante \"Esci\" nella gestione utente.",
          "L'utente cancella manualmente la cache dell'app.",
          "Ottimizzazioni nel menu modale dei lavori in preparazione all'inserimento dei dati completi.",
          "Miglioramenti estetici nel menu utente.",
          "Aggiunti circa 50 nuovi lavori al database."
        ]
      },
      {
        "version": "Beta 0.4",
        "changes": [
          "Aggiunta la visualizzazione delle immagini a schermo intero: ora è possibile cliccare sulle immagini per ingrandirle e zoomarle.",
          "Ripristinata la sezione \"Info dettagliate\" nel menu modale dei lavori.",
          "Implementata la funzione di scorrimento nel menu modale dei lavori.",
          "Aggiunta la minimizzazione del menu modale: il menu non scompare più cliccando all'esterno quando è minimizzato.",
          "Nuove informazioni nei dettagli dei lavori: ora includono lo stato attuale e l’importo.",
          "Introdotta la gestione dinamica delle dimensioni del menu modale:",
          "Minimizzato: 100px",
          "Medio: 50% dell’altezza dello schermo",
          "Massimo: 90% su smartphone, 80% su PC",
          "Risolto un bug nel menu utente: i pulsanti nella gestione profilo ora vengono visualizzati correttamente.",
          "Aggiunte due nuove sezioni nel menu utente:",
          "Aggiornamenti App",
          "Impostazioni"
        ]
      }
    ]
  }
  